{
  "START": {
    "name": "Comenzando la colonia",
    "shortDescription": "Inicia el protocolo de asentamiento y accede al diario de misiones.",
    "descriptions": [
      "CAPITÁN: LUCAS VERA",
      "ESTADO: DESCRIÓGENESIS COMPLETADA [✓]",
      "TIEMPO DESDE EL EVENTO \"ÉXODO SOLAR\": 18 AÑOS, 241 DÍAS",
      "SINCRONIZANDO MEMORIA DE NAVE...",
      "ACTUALIZACIÓN COMPLETA.",
      "<>",
      "Bienvenido de nuevo, Capitán Vera. Me complace informar que tu criostasis se ha completado con éxito, sin anomalías neurológicas ni fisiológicas detectadas.",
      "Lamento ser quien deba transmitir esta noticia: la Tierra, y gran parte de la civilización humana, ya no existe como la conocimos. La amenaza conocida como Entidad Omega completó la aniquilación del sistema solar interior 11 años después de nuestra salida. Las últimas transmisiones recibidas indican resistencia fallida en Titán y Ceres.",
      "Nuestra misión primaria se ha reescrito bajo protocolo Arca Alfa: Preservar y reconstruir la especie humana.",
      "Hemos llegado a un planeta desconocido en el sector Lira-94, designado provisionalmente como Éxilon. La atmósfera es respirable con modificaciones mínimas. Gravedad estable. Recursos detectados.",
      "<>",
      "Escaneos de superficie detectaron formaciones regulares de origen no natural a 2.4 kilómetros del punto de aterrizaje. Geometría angular. Simetría axial. Materiales desconocidos, no coincidentes con roca marciana ni aleaciones humanas.",
      "La nave ha aterrizado de forma segura tras una maniobra automatizada. Sistemas de soporte funcionando a 82%. Tripulación restante en criosueño.",
      "Tú eres el primero, Capitán. El futuro depende de tus decisiones.",
      "Recomiendo: iniciar exploración inicial, reactivación de equipo de misión, y comenzar despliegue de módulo base.",
      "Estoy contigo. Siempre."
    ]
  },
  "BUILDING_LAB1": {
    "name": "Laboratorio",
    "shortDescription": "Construye un laboratorio para comenzar la investigación científica.",
    "descriptions": [
      "Nuestros datos científicos son insuficientes.",
      "Construir un laboratorio tecnológico es esencial para entender los recursos y amenazas de este planeta.",
      "Prioriza su construcción. El conocimiento es poder."
    ]
  },
  "RESEARCH_MINING1": {
    "name": "Primera investigación",
    "shortDescription": "Investiga minería para identificar zonas ricas en recursos.",
    "descriptions": [
      "Los escáneres muestran grandes depósitos minerales bajo la superficie.",
      "Pero no podemos ponernos a excavar sin más. Hay que analizar bien la geología del planet para ver donde podemos comenzar las excavaciones.",
      "Inicia la investigación de tecnologías de minería básica inmediatamente."
    ]
  },
  "BUILDING_METALLURGY1": {
    "name": "Mina de metales",
    "shortDescription": "Establece una mina para extraer metales esenciales.",
    "descriptions": [
      "La reserva de aleaciones metálicas se agota rápidamente.",
      "Necesitamos empezar a procesar separar los pocos metales que obtenemos del subsuelo.",
      "Actúa con urgencia. Cada segundo cuenta."
    ]
  },
  "BUILDING_QUARRY1": {
    "name": "Cantera",
    "shortDescription": "Construye una cantera para obtener minerales estructurales.",
    "descriptions": [
      "Los cimientos de nuestra colonia requieren materiales sólidos.",
      "Necesitamos una cantera para extraer minerales estructurales del terreno.",
      "Hazlo posible. Este planeta no nos dará otra oportunidad."
    ]
  },
  "BUILDING_KRYSTALMINE1": {
    "name": "Mina de cristal",
    "shortDescription": "Extrae cristales energéticos para impulsar nuestras tecnologías.",
    "descriptions": [
      "Detectamos formaciones cristalinas con potencial energético excepcional.",
      "Una mina de cristal abrirá nuevas posibilidades tecnológicas.",
      "Establece la operación cuanto antes. Las estrellas observan."
    ]
  },
  "BUILDING_BASE2": {
    "name": "Base de nivel 2",
    "shortDescription": "Mejora la base para aumentar capacidad y soporte vital.",
    "descriptions": [
      "Las cosas van bien, la población de la colonia va aumentando y nuestros objetivos serán cada vez más ambiciosos.",
      "Ampliar la base es imprescindible para continuar con nuestro crecimiento.",
      "El futuro de la colonia depende de este paso."
    ]
  },
  "BUILDING_ANTENNA": {
    "name": "Antenas de radio",
    "shortDescription": "Construye una antena para intentar contactar con el exterior.",
    "descriptions": [
      "Aún no hay señales del resto de la humanidad...",
      "Construir una antena podría ser nuestra única forma de contacto con el exterior.",
      "Si hay alguien ahí fuera... debemos intentarlo."
    ]
  },
  "BUILDING_HANGAR": {
    "name": "Hangar",
    "shortDescription": "Prepara un hangar para construir y lanzar naves.",
    "descriptions": [
      "Hemos detectado algunos sistemas que pueden interesantes. Los planos de fabricación de naves están listos pero sin un hangar, estamos atados a este planeta.",
      "Construye uno lo antes posible, necesitamos comenzar a construir sondas para confirmar nuestros hallazgos.",
      "El universo no esperará por nosotros."
    ]
  },
  "SHIP_FIRST": {
    "name": "Primera flota",
    "shortDescription": "Construye la primera nave de nuestra colonia.",
    "descriptions": [
      "El hangar está operativo. La nave prototipo está casi lista.",
      "Esta será la primera nave construida en este sistema.",
      "Comandante, autorice la fabricación. Nuestra expansión comienza ahora."
    ]
  },
  "H2O_FOUND": {
    "name": "Extracción de agua",
    "shortDescription": "Construye una planta de procesamiento de agua.",
    "descriptions": [
      "Capitán, hemos localizado una zona con depósitos extensos de hielo subsuperficial en el cuadrante Delta-7.",
      "La profundidad media es de apenas 12 metros, y la densidad supera el umbral necesario para una operación sostenida de extracción y procesamiento.",
      "La composición es estable: 91% H₂O, con impurezas mínimas. Los datos sugieren que el área podría mantener el suministro hídrico de una colonia durante varios ciclos estándar.",
      "Es el primer hallazgo de esta magnitud desde el aterrizaje.",
      "Recomendación: establecer una estación de perforación, iniciar montaje del sistema de purificación y asegurar la zona.",
      "Tenemos agua, Capitán. Tenemos futuro"
    ]
  },
  "ALIEN_TECH_FOUND": {
    "name": "Tecnología alienígena",
    "shortDescription": "Construye una planta de procesamiento de agua.",
    "descriptions": [
      "Capitán, durante una exploración rutinaria en el sector Kappa-3, el equipo ha encontrado restos materiales de origen no humano.",
      "Estructuras parcialmente colapsadas, patrones geométricos no naturales y una aleación desconocida sin correspondencia en bases de datos terrestres o marcianas.",
      "No hay señales de actividad reciente, pero la degradación sugiere una antigüedad milenaria... o algo que no se degrada fácilmente.",
      "Este hallazgo no debe ser comunicado a la tripulación general hasta confirmar su naturaleza.",
      "Recomendación: establecer perímetro restringido, designar equipo reducido de análisis y registrar hallazgo bajo etiqueta interna: \"Ecos\".",
      "No sabemos quiénes fueron. Pero estuvieron aquí."
    ]
  },
  "H2O_SEARCH": {
    "name": "Busqueda de agua",
    "shortDescription": "Construye una planta de procesamiento de agua.",
    "descriptions": [
      "Capitán, las reservas de agua reciclada han descendido por debajo del umbral operativo.",
      "La tasa de consumo actual supera la capacidad de regeneración del sistema. Continuar sin una fuente externa comprometerá la supervivencia de la colonia.",
      "El subsuelo planetario presenta indicios de humedad atrapada, pero se requiere una exploración detallada para confirmar su viabilidad.",
      "Recomendación inmediata: desplegar drones de sondeo y priorizar la búsqueda de depósitos de hielo o acuíferos.",
      "Sin agua, no hay colonia."
    ]
  },
  "SCAN_FIRST": {
    "name": "Explorando la galaxia",
    "shortDescription": "Utiliza la antena para escanear otros sistemas estelares. Necesitamos conocer el vecindario.",
    "descriptions": [
      "Capitán, los sensores indican que nos encontramos en una región rica en posibilidades. Variaciones en la radiación cósmica sugieren que algunos sistemas cercanos podrían albergar recursos valiosos, formas de vida desconocidas o incluso restos de tecnología olvidada.",
      "Explorar más allá de nuestra posición actual no solo ampliará nuestro conocimiento del sector, sino que podría brindarnos una ventaja decisiva para el desarrollo de la colonia. Cada escaneo nos acerca un paso más a comprender este mundo y sus secretos.",
      "Los sistemas de escaneo están listos y a su disposición. ¿Quién sabe qué maravillas se esconden más allá de nuestro alcance visual? El universo no espera. Actívese el protocolo de exploración."
    ]
  },
  "EXPLORE_FIRST": {
    "name": "Investigando un sistema cercano",
    "shortDescription": "Envía una sonda al sistema que acabas de scanear. Necesitamos averiguar si está habitado.",
    "descriptions": [
      "Capitán, los registros estelares han sido actualizados. Varios sistemas cercanos presentan condiciones prometedoras para una primera exploración. Las señales gravitacionales y térmicas indican actividad inusual, digna de una sonda de reconocimiento.",
      "Enviar una sonda al sistema que elija marcará el inicio oficial de nuestra expansión. Esta primera misión no solo revelará datos valiosos sobre posibles recursos, sino que también sentará las bases para futuras operaciones interplanetarias.",
      "El equipo de navegación está preparado. Basta una orden suya para lanzar la primera mirada más allá de nuestra estrella. Que este sea el comienzo de nuestro mapa en las estrellas, capitán."
    ]
  }
}
