{
  "buildingName": {
    "BASE": "BASE",
    "LAB": "Lab",
    "METALLURGY": "Metal Mine",
    "QUARRY": "Quarry",
    "KRYSTALMINE": "Crystal Mine",
    "ANTENNA": "Communications Antenna",
    "HANGAR": "Hangar",
    "ROCKET": "Rocket Launchpad",
    "ENERGY": "Power Plant",
    "SPACESTATION": "Space Station",
    "RECYCLE": "Recycling Center",
    "RESIDUE": "Waste Facility",
    "GREENHOUSE": "Greenhouse",
    "WATEREXTRACTOR": "Water Extractor",
    "ALIEN_LAB": "X-23 Lab",
    "EMBASSY": "Interplanetary embassy"
  },
  "buildingDescription": {
    "BASE": "Nerve center of the colony. Manages general operations, monitors resources, and coordinates planetary expansion and defense.",
    "LAB": "Advanced research facility where scientists develop new technologies, analyze planetary resources, and unlock upgrades for the colony.",
    "METALLURGY": "Facility specialized in extracting and refining metals. Provides essential structural materials for construction and colony expansion.",
    "QUARRY": "Designed for the mass extraction of stone, sand, and other non-metallic materials. Provides key resources for reinforcing colonial structures.",
    "KRYSTALMINE": "Specialized mine for locating and collecting rare crystals and exotic compounds. These are valuable for research and advanced manufacturing.",
    "ANTENNA": "Planetary communications antenna that connects with probes, ships, and other colonies. Essential for remote operations and mission planning.",
    "HANGAR": "Facility for storing, maintaining, and launching atmospheric vehicles. Supports local transport and reconnaissance missions.",
    "ROCKET": "Interplanetary launch complex capable of assembling, fueling, and launching rockets or crewed ships. Enables export and expansion.",
    "ENERGY": "Power plant that converts solar, geothermal, or chemical energy into electricity. Feeds all critical systems of the colony.",
    "SPACESTATION": "Multi-function orbital station. Manages space resources, surveillance, defense, and acts as a strategic hub for stellar expansion.",
    "RECYCLE": "Facility that processes organic and reusable waste. Reduces pollution and recovers valuable materials for production.",
    "RESIDUE": "Facility for managing non-recyclable waste. Stores, neutralizes, or contains hazardous materials to prevent environmental risks.",
    "GREENHOUSE": "Climate-controlled structure for growing crops. Provides food, oxygen, and livable conditions for colonists on a hostile planet.",
    "WATEREXTRACTOR": "Facility that processes subterranean ice. Extracts and purifies water for human consumption.",
    "ALIEN_LAB": "Laboratory for analyzing alien technological remains. Also synthesizes new materials and studies alien DNA.",
    "EMBASSY": "It is a diplomatic institution that facilitates communication, trade and cooperation between different planets or galactic civilizations."
  },
  "ExtractionSystems": "Mineral Extraction Systems",
  "LocalDefenses": "Local Defenses",
  "StellarPort": "Stellar Port"
}
